// 1. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.
// let a = 10
// if (a === 10) {
//     console.log("Верно")
// }else {
//     console.log("Неверно")
// }
// 2. Вам даны две переменные a=50, b=100. Составьте условие,
// по которому в консоль будет выводиться 'a больше b', 'a меньше b'.
// let a = 50, b = 100
// if (a > b) {
//     console.log('a больше b')
// }else {
//     console.log('a меньше b')
// }

// 3. Вам дана переменная a=-2. Составьте условие, по которому в консоль будет выводиться 'positive' - если число больше 0,
// 'равно' если число равно 0, "negative" если число меньше 0.

// let a = 0
// if (a > 0) {
//     console.log('positive')
// }else if (a === 0) {
//     console.log('равно')
// }else if (a < 0) {
//     console.log("negative")
// }

// 4. Вам дана переменная number=45. Составьте условие,
// по которому будет выводиться в консоль "Четное число", "Нечетное число".

// let number = 44
// if (number % 2 === 0) {
//     console.log("Четное число")
// }else {
//     console.log("Нечетное число")
// }

// 5. Вам даны две переменные a=10, b=2. Составьте условие, по которому, остаток деления a на b,
// будет выводиться консоль "Четное число", "Нечетное число".

// let a = 10, b = 3
// if (a % b === 0 ) {
//     console.log("Четное число")
// }else {
//     console.log("Нечетное число")
// }

// 6. Вам дана переменная s. Составьте условие, по которому в консоль будет выводится
// тип этой переменной - "boolean", "number", "string".

// let s = 2414
// console.log(typeof s)

// 7. Вам дана переменная а. Если переменная a больше одного и меньше 9-ти,
// то выведите 'Верно', иначе выведите 'Неверно'.

// let a = 2
// if (a > 1 && a < 9) {
//     console.log('Верно')
// }else {
//     console.log('Неверно')
// }

// 8. Вам дана переменная а. Если переменная a равна трем или равна семи, то
// прибавьте к ней 7, иначе поделите ее на 10. Выведите новое значение
// переменной в консоль.

// let a = 40
// if (a === 3 || a === 7) {
//     console.log(a + 7)
// }else {
//     console.log(a / 10)
// }

// 9. Вам даны переменные а , b. Если переменная a равна или меньше 0,
// а переменная b больше или равна 5, то выведите сумму этих переменных,
// иначе выведите их разность (результат вычитания).

// let a = 4, b = 4
// if (a <= 0 || b >= 5) {
//     console.log(a + b)
// }else {
//     console.log(a - b)
// }
// 10. Вам даны переменные a , b. Если переменная a больше 4-х и меньше 10-ти,
// или переменная b больше или равна 7-ми и меньше 17-ти, то выведите 'Верно',
// в противном случае выведите 'Неверно'

// let a = 5, b = 9
// if (a > 4 && a < 10 || b >= 7 && b < 17) {
//     console.log('Верно')
// }else {
//     console.log('Неверно')
// }

// 11. Вам дана переменная month. В ней лежит какое-то число из интервала от
// 1 до 12. Определите в какую пору года попадает этот месяц (зима, лето,
// весна, осень).
// let month = 2
// if ()
// 12. Вам дана переменная day. В ней лежит какое-то число из интервала от 1
// до 31. Определите в какую декаду месяца попадает это число (в первую, вторую
// или третью).
// let day = 15
// if (day <= 10) {
//     console.log("Первый")
// }else if (day <= 20) {
//     console.log("Второй")
// }else if (day <= 30) {
//     console.log("Третий")
// }
// 13. Вам дана переменная a='12345'. Проверьте, что первым символом этой
// переменной является цифра 1, 2 или 3. Если это так – выведите ‘да’, в
// противном случае выведите ‘нет’.

// let a='312345'
// if (a[0] == 1 || a[0] == 2 || a[0] == 3){
//     console.log("да")
// }else {
//     console.log("нет")
// }